Venue Options for Tech Innovation Conference in San Francisco:

1. Main Hall at Trellis
Location: South Beach, San Francisco, CA
Description: A versatile space with rustic charm and modern amenities, perfect for conferences and panel discussions.
Capacity: 150-200 guests
Cost: Minimum spend of $1500 per session

2. Meeting Room 3A at Werqwise San Mateo
Location: Baywood, San Francisco, CA
Description: A modern meeting room with a capacity of 5-7 guests, ideal for small group discussions or breakout sessions.
Cost: Hire fee of $100 per hour

3. 2nd Floor at Dogpatch Studios
Location: Dogpatch, San Francisco, CA
Description: A spacious event venue with a capacity of 110-140 guests, suitable for larger conferences and presentations.
Cost: Hire fee of $3000 per session

4. Stunning & Sunlit Event Venue at The Farm SF
Location: Downtown San Francisco-Union Square, CA
Description: A sunlit event venue with a capacity of 45 guests, offering a warm and inviting atmosphere for conferences.
Cost: Hire fee of $470 per hour

5. Meeting Room at Intelligent Office Financial District
Location: Financial District, San Francisco, CA
Description: A professional meeting room with a capacity of 5 guests, perfect for intimate discussions or small group meetings.
Cost: Hire fee of $50 per hour

6. Sequoia at Workstation West Berkeley
Location: West Berkeley, San Francisco, CA
Description: A versatile space with a capacity of 40 guests, suitable for workshops, seminars, and networking events.
Cost: Hire fee of $200 per hour

7. Mojave at Workstation West Berkeley
Location: West Berkeley, San Francisco, CA
Description: A cozy meeting room with a capacity of 25 guests, ideal for small group discussions or training sessions.
Cost: Hire fee of $35 per hour

8. Hyacinth at Trellis
Location: South Beach, San Francisco, CA
Description: An elegant meeting space with a capacity of 8 guests, perfect for executive meetings or private discussions.
Cost: Hire fee of $75 per hour

9. Turn-key Studio & Meeting Space at The Producer's Loft Studio
Location: Mission District, San Francisco, CA
Description: A spacious studio with a capacity of 70-100 guests, suitable for workshops, presentations, and networking events.
Cost: Hire fee of $250 per hour

10. Ivy at Trellis
Location: South Beach, San Francisco, CA
Description: A stylish meeting room with a capacity of 8 guests, ideal for small group discussions or brainstorming sessions.
Cost: Hire fee of $75 per hour

These venue options provide a range of choices for the Tech Innovation Conference, catering to different event sizes and requirements. Each venue offers unique amenities and settings to enhance the conference experience for attendees.